Revit 2027 API
ParameterTypeId.RebarSystemSpanhookRightDirn1 Property
 "Hook Angle Right"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RebarSystemSpanhookRightDirn1 { get; }
Public Shared ReadOnly Property RebarSystemSpanhookRightDirn1 As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RebarSystemSpanhookRightDirn1 {
	ForgeTypeId^ get ();
}
static member RebarSystemSpanhookRightDirn1 : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace